#ifndef _HP_H_
#define _HP_H_

class HP
{
public:
	/******************************
	*  引数無しコンストラクタ
	******************************/
	HP();
	/******************************
	*　引数ありコンストラクタ
	*******************************/
	HP(int value);

	/******************************
	*  デストラクタ
	******************************/
	~HP();

	/******************************
	*  生きているかどうか
	*******************************/
	bool isDead();

	/******************************
	*  HP取得関数
	******************************/
	int getHp()const;

	HP& operator -= (int);
	HP& operator += (int);
	bool operator == (const HP& hp);
	bool operator != (const HP& hp);
private:
	int hp;
};



#endif